export const careerData = [
  {
    data: '2023.04 - 2023.11',
    title: '아이쇼핑',
    role: '@ 백엔드팀 - 백엔드 총괄',
    infos: [
      '백엔드에서 DB에 저장된 데이터를 통합 처리하여 ChatGPT 다빈치 모델을 활용',
      '자연어 생성 최적화 및 문장 연결 구조와 어미 처리 개선',
      '문장 오류율 20% 감소, 문장 이해도와 가독성 30% 향상',
      '사용자 메시지의 완성도 및 신뢰도를 개선하여 UX(사용자 경험) 증대',
      '프론트엔드로 전달되는 사용자 메시지의 완성도와 신뢰도 개선으로 사용자 경험(UX) 증대',
      '2진법 데이터를 10진법으로 변환하여 백엔드 저장 프로세스 구현',
      '데이터 처리 속도 50% 향상, 변환 정확도 99.9% 유지',
    ],
    stacks: ['spring', 'ncp', 'ai'],
  },
  {
    data: '2023.11 - 2024.12',
    title: '(주)아이페이지온',
    role: '@ OSS 개발팀',
    infos: [
      'MSA 구조에서 INT API 블럭의 명령줄 인터페이스 페이지 개발 담당',
      '기존 Tree 구조 데이터 정규화를 통해 데이터 중복 제거 및 유지보수성 향상',
      'Parent-Child 관계 기반의 트리 데이터를 관계형 데이터베이스에 저장하는 구조 설계',
      '3개의 테이블 설계를 통해 Parent-Child 관계를 효율적으로 관리하며, 데이터 조회 최적화',
    ],
    stacks: ['spring', 'thymeleaf'],
  },
  {
    data: '2025.02 - 재직중',
    title: '(주)파츠몰',
    role: '@ 전산팀',
    infos: [
      '파츠몰 ERP 및 B2B/B2C 시스템',
      '파트존 리뉴얼 대응 신규 페이지 개발 및 유지보수',
      'React·Spring·JSP 기반 부품 검색/장바구니/패키지 관리 기능 구현',
      'Redis 기반 대기열 시스템 설계 및 성능 최적화',
      '동시 접속 제어·보안 강화·클라우드 환경 최적화로 안정성 확보'
    ]
    ,
    stacks: ['spring', 'thymeleaf','react'],
  }
];
