export const recordData = [
  {
    data: '2023.04 - 2023.09',
    title: '네이버클라우드 교육',
    role: '@ NCP , Web 풀스택 교육',
    infos: [
      "JavaScript, React, Spring Boot 학습",
    "매일 강도 높은 과제를 수행하며 페어 프로그래밍과 코드 리뷰 경험",
    "솔로 프로젝트 1회 및 협업 프로젝트 2회 진행",
    "스터디와 협업을 통해 개발 역량 강화 및 동료와의 소통 능력 함양",
    "NCP 기반 소프트웨어 설계, CI/CD 구축, 폐쇄망 클라우드 효율적 구축 경험"
    ],
    stacks: [ 'javascript', 'react', 'ncp','spring'],
  },
  {
    data: '2023.08 - 2023.10',
    title: '원티드 백엔드 인턴쉽',
    role: '@ 알고리즘 교육',
    infos: ['대규모 트래픽에 관한 소프트웨어 설계 스터디',
      '시간복잡도 , 공간복잡도를 효율적으로 만들기위한 팀 스터디',
      '핵심 알고리즘 문제 학습 및 발표',],
    stacks: ['java'],
  },
  {
    title: '코-취 ',
    role: '@ 알고리즘 교육 , 우수 수료생',
    infos: [
     'JAVA , PYTHON 를 이용한 알고리즘 교육',
      '주 30개의 알고리즘 을 이용해 개발하여 진행',
      '그릿테스트 기업 과제를 모의 개발하며 경쟁 참여',
    ],
    stacks: ['java','python'],
  },
  {
    "data": "2018.02 - 2023.02",
    "title": "컴퓨터시스템과",
    "role": "@ 컴퓨터 시스템 및 소프트웨어 개발 전공",
    "infos": [
      "C, C++, Java, Python 등 프로그래밍 언어 학습",
      "데이터베이스 설계, 운영체제, 네트워크 기초 및 응용 과목 이수",
      "알고리즘, 자료구조, 웹 프로그래밍 등 전공 심화 학습",
      "캡스톤디자인 및 팀 프로젝트 수행으로 협업 및 실무 능력 배양",
      "AI와 머신러닝 응용, IoT 임베디드 개발 경험"
    ],
    "stacks": ["java", "python", "javascript"]
  },
];
